app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    <i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
    <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
    <i class="glyphicon glyphicon-heart-empty" aria-hidden="true"></i>
    <%= book.favorites.count %>