app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    					<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
    					<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
    					<i class="glyphicon glyphicon-heart-empty" aria-hidden="true"></i>
    					<%= book.favorites.count %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
					<% end %></td>
					<td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>