app/views/books/index.html.erb

					<td><%= render 'favorites/favorite', book: book %></td>
					<td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>
---
SELECT "books".* FROM "books"