app/views/books/show.html.erb

    					<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
    					<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]

    					<i class="glyphicon glyphicon-heart-empty" aria-hidden="true"></i>
    					<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]

					<% end %></td>
					<td><%= link_to "#{@book.book_comments.count} コメント", book_path(@book.id) %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]

				<h3>Comments</h3>
			<% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]