app/views/books/show.html.erb

					<td><%= render 'favorites/favorite', book: @book %></td>
					<td><%= link_to "#{@book.book_comments.count} コメント", book_path(@book.id) %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]