app/views/searches/search.html.erb

    					<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
    					<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]

					<% end %></td>
					<td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>
---
SELECT "books".* FROM "books" WHERE (title LIKE '%2')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]