app/controllers/book_comments_controller.rb

	def destroy
		@book = Book.find(params[:book_id])
		@comment = BookComment.find(params[:id])
		@comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]

	def show
		@comment = BookComment.find(params[:id])
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]