app/models/user.rb

INSERT INTO "relationships" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["following_id", 1], ["created_at", "2020-05-06 22:00:07.428710"], ["updated_at", "2020-05-06 22:00:07.428710"]]
---
  def follow!(other_user)
    following_relationships.create!(following_id: other_user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow!(other_user)
    following_relationships.find_by(following_id: other_user.id).destroy